# GetPlantToolPlacementMode

## Description
This returns the current placement mode stored in the plant tool

```pascal
FUNCTION GetPlantToolPlacementMode : INTEGER;
```

```python
def vs.GetPlantToolPlacementMode():
    return INTEGER
```

## Version
Availability: from VectorWorks13.0

## Category
* Utility